{
  "meta": {
    "title": "Biochemistry Glossary",
    "version": "1.0",
    "lastUpdated": "2026-02-05"
  },
  "terms": [
    {
      "term": "Adenosine Triphosphate (ATP)",
      "category": "Energy & Metabolism",
      "definition": "The primary energy currency of cells. Hydrolysis of the phosphoanhydride bond releases ~30.5 kJ/mol of energy under standard conditions, driving most cellular processes.",
      "example": "ATP hydrolysis to ADP + Pi powers muscle contraction, active transport, and protein synthesis."
    },
    {
      "term": "Amino Acid",
      "category": "Proteins",
      "definition": "Organic molecule containing an amino group (-NH2), a carboxyl group (-COOH), and a variable side chain (R group) bonded to a central carbon. The building blocks of proteins.",
      "example": "The 20 standard amino acids include alanine, glycine, glutamate, and tryptophan."
    },
    {
      "term": "Enzyme",
      "category": "Catalysis",
      "definition": "A protein (or RNA) catalyst that accelerates biochemical reactions by lowering the activation energy without being consumed in the reaction.",
      "example": "Lactase breaks down lactose into glucose and galactose in the small intestine."
    },
    {
      "term": "Substrate",
      "category": "Catalysis",
      "definition": "The molecule or molecules upon which an enzyme acts. Substrates bind to the enzyme's active site to form an enzyme-substrate complex before catalysis occurs.",
      "example": "In the reaction catalyzed by amylase, the substrate is starch."
    },
    {
      "term": "Michaelis-Menten Kinetics",
      "category": "Enzyme Kinetics",
      "definition": "A steady-state model describing enzyme-catalyzed reactions. The rate of reaction depends on enzyme concentration, substrate concentration, and two key parameters: Km (Michaelis constant) and Vmax (maximum velocity).",
      "example": "v = (Vmax × [S]) / (Km + [S])"
    },
    {
      "term": "Km (Michaelis Constant)",
      "category": "Enzyme Kinetics",
      "definition": "The substrate concentration at which the reaction rate is half of Vmax. A measure of the enzyme's affinity for its substrate—lower Km indicates higher affinity.",
      "example": "Hexokinase has a Km of ~0.1 mM for glucose, indicating tight binding."
    },
    {
      "term": "Vmax (Maximum Velocity)",
      "category": "Enzyme Kinetics",
      "definition": "The maximum rate of an enzyme-catalyzed reaction, achieved when all enzyme molecules are saturated with substrate. Proportional to enzyme concentration (Vmax = kcat × [E]total).",
      "example": "If enzyme concentration doubles, Vmax doubles."
    },
    {
      "term": "kcat (Turnover Number)",
      "category": "Enzyme Kinetics",
      "definition": "The number of substrate molecules converted to product per enzyme molecule per unit time when the enzyme is fully saturated. Also called molecular activity.",
      "example": "Catalase has a kcat of ~4 × 10^6 s⁻¹ for H₂O₂, one of the fastest known enzymes."
    },
    {
      "term": "Activation Energy",
      "category": "Thermodynamics",
      "definition": "The minimum energy required for a chemical reaction to proceed. Enzymes work by lowering the activation energy, making reactions proceed faster at physiological temperatures.",
      "example": "The activation energy for glucose oxidation without enzymes is high; with enzymes, it's much lower."
    },
    {
      "term": "Metabolic Pathway",
      "category": "Metabolism",
      "definition": "A series of chemical reactions catalyzed by enzymes that converts substrate molecules into products. Examples include glycolysis, the citric acid cycle, and oxidative phosphorylation.",
      "example": "Glycolysis is a 10-step pathway converting glucose to pyruvate."
    },
    {
      "term": "Glycolysis",
      "category": "Metabolism",
      "definition": "A metabolic pathway in the cytoplasm that converts glucose (C6) into two pyruvate molecules (C3), generating 2 net ATP and 2 NADH. The first stage of cellular respiration.",
      "example": "Glucose → 2 Pyruvate + 2 ATP + 2 NADH in 10 enzymatic steps."
    },
    {
      "term": "Citric Acid Cycle (Krebs Cycle, TCA Cycle)",
      "category": "Metabolism",
      "definition": "A cyclic metabolic pathway in the mitochondria that oxidizes acetyl-CoA to CO₂ while generating reducing equivalents (NADH, FADH₂) for the electron transport chain.",
      "example": "Each acetyl-CoA that enters produces 3 NADH, 1 FADH₂, and 1 GTP."
    },
    {
      "term": "Oxidative Phosphorylation",
      "category": "Metabolism",
      "definition": "The process by which ATP is synthesized using the proton gradient generated by the electron transport chain across the inner mitochondrial membrane.",
      "example": "NADH and FADH₂ donate electrons to the electron transport chain, driving ATP synthesis."
    },
    {
      "term": "NAD+ / NADH",
      "category": "Coenzymes",
      "definition": "Nicotinamide adenine dinucleotide (oxidized/reduced form). A coenzyme that accepts electrons in oxidative reactions; serves as an electron carrier in metabolism.",
      "example": "Glyceraldehyde-3-phosphate dehydrogenase oxidizes G3P to 1,3-bisphosphoglycerate, reducing NAD+ to NADH."
    },
    {
      "term": "FAD / FADH₂",
      "category": "Coenzymes",
      "definition": "Flavin adenine dinucleotide (oxidized/reduced form). A coenzyme that accepts electrons and protons; important electron carrier in the electron transport chain.",
      "example": "FADH₂ from succinate dehydrogenase feeds electrons directly into Complex II of the electron transport chain."
    },
    {
      "term": "Coenzyme",
      "category": "Coenzymes",
      "definition": "A non-protein organic molecule that assists enzymes in catalysis. Often derived from vitamins (e.g., NAD+ from niacin, FAD from riboflavin).",
      "example": "Thiamine pyrophosphate (TPP) is a coenzyme for pyruvate dehydrogenase."
    },
    {
      "term": "Cofactor",
      "category": "Catalysis",
      "definition": "A non-protein substance required for enzyme activity, including metal ions (Mg2+, Zn2+, Fe2+) and coenzymes (NAD+, FAD).",
      "example": "Carbonic anhydrase requires a Zn2+ ion in its active site."
    },
    {
      "term": "Acetyl-CoA",
      "category": "Metabolic Intermediates",
      "definition": "Acetyl coenzyme A; a central metabolic molecule linking glycolysis to the citric acid cycle. Carries a 2-carbon acetyl group for oxidation in the TCA cycle.",
      "example": "Pyruvate from glycolysis is oxidized to form Acetyl-CoA, which enters the citric acid cycle."
    },
    {
      "term": "Glucose",
      "category": "Carbohydrates",
      "definition": "A 6-carbon monosaccharide (C₆H₁₂O₆) and the primary fuel molecule for cellular energy. Exists in both open-chain (aldehyde) and cyclic (pyranose) forms.",
      "example": "Blood glucose is tightly regulated between 70-100 mg/dL in fasting state."
    },
    {
      "term": "Glycogen",
      "category": "Carbohydrates",
      "definition": "A branched polymer of glucose stored in liver and muscle cells as an energy reserve. Rapidly mobilized during fasting or exercise.",
      "example": "Liver glycogen is depleted to maintain blood glucose during fasting."
    },
    {
      "term": "Cholesterol",
      "category": "Lipids",
      "definition": "A sterol lipid (C₂₇H₄₆O) essential for cell membrane structure and as a precursor for steroid hormones and vitamin D. Synthesized primarily in the liver.",
      "example": "Cholesterol is a major component of lipid rafts in cell membranes."
    },
    {
      "term": "Fatty Acid",
      "category": "Lipids",
      "definition": "Long-chain carboxylic acids with hydrophobic tails. Can be saturated (no double bonds) or unsaturated (with C=C double bonds). Stored as triglycerides or used for energy via β-oxidation.",
      "example": "Palmitic acid (C16:0) is a common saturated fatty acid; oleic acid (C18:1) is unsaturated."
    },
    {
      "term": "Beta-Oxidation (β-Oxidation)",
      "category": "Metabolism",
      "definition": "Metabolic pathway in mitochondria that breaks down fatty acids into 2-carbon acetyl-CoA units, generating NADH and FADH₂ for energy production.",
      "example": "Palmitate undergoes 7 rounds of β-oxidation to yield 8 acetyl-CoA."
    },
    {
      "term": "Protein Synthesis",
      "category": "Gene Expression",
      "definition": "The process of building proteins from mRNA using ribosomes and tRNA. Consists of initiation, elongation, and termination phases.",
      "example": "A 100-amino acid protein requires ~300 nucleotides of mRNA."
    },
    {
      "term": "Translation",
      "category": "Gene Expression",
      "definition": "The process by which ribosomes decode mRNA and synthesize proteins. Occurs on ribosomes in the ribosome-mRNA complex using tRNA anticodon-codon pairing.",
      "example": "Initiation begins with the start codon AUG; termination occurs at stop codons UAA, UAG, UGA."
    },
    {
      "term": "Transcription",
      "category": "Gene Expression",
      "definition": "The process by which RNA polymerase synthesizes mRNA from a DNA template. Occurs in the nucleus in eukaryotes and in the cytoplasm in prokaryotes.",
      "example": "RNA polymerase II transcribes protein-coding genes in eukaryotes."
    },
    {
      "term": "DNA",
      "category": "Nucleic Acids",
      "definition": "Deoxyribonucleic acid; a double-stranded polynucleotide that stores genetic information. Based on the four deoxyribose sugars with A, T, G, C nitrogenous bases.",
      "example": "The human genome contains ~3 billion base pairs."
    },
    {
      "term": "RNA",
      "category": "Nucleic Acids",
      "definition": "Ribonucleic acid; a single-stranded polynucleotide with ribose sugar and A, U, G, C bases. Multiple functional forms: mRNA, tRNA, rRNA.",
      "example": "mRNA carries genetic information; tRNA delivers amino acids; rRNA catalyzes peptide bond formation."
    },
    {
      "term": "ATP Synthase",
      "category": "Membrane Proteins",
      "definition": "A transmembrane protein complex in mitochondria, chloroplasts, and bacteria that synthesizes ATP using the proton gradient. Rotates using the electrochemical potential.",
      "example": "ATP synthase can produce ~100 ATP molecules per second per complex."
    },
    {
      "term": "Active Transport",
      "category": "Membrane Transport",
      "definition": "Movement of molecules against the concentration gradient using ATP energy. Mediated by transport proteins like Ca²⁺-ATPase and Na⁺/K⁺-ATPase.",
      "example": "The Na⁺/K⁺-ATPase pumps 3 Na⁺ out and 2 K⁺ in per ATP hydrolyzed."
    },
    {
      "term": "Passive Transport",
      "category": "Membrane Transport",
      "definition": "Movement of molecules down the concentration gradient without energy input. Includes simple diffusion and facilitated diffusion.",
      "example": "Glucose enters red blood cells via facilitated diffusion through GLUT1 transporter."
    },
    {
      "term": "Osmosis",
      "category": "Solution Chemistry",
      "definition": "The movement of solvent molecules across a semipermeable membrane toward the side with higher solute concentration. Driven by differences in water potential.",
      "example": "Water moves into a hypertonic solution, causing cell swelling."
    },
    {
      "term": "pH",
      "category": "Solution Chemistry",
      "definition": "A measure of hydrogen ion concentration; pH = -log[H⁺]. pH < 7 is acidic, pH = 7 is neutral, pH > 7 is basic. Physiological pH is ~7.4.",
      "example": "Stomach acid has pH ~2; blood has pH ~7.4."
    },
    {
      "term": "Buffer",
      "category": "Solution Chemistry",
      "definition": "A solution that resists changes in pH when acid or base is added. Typically consists of a weak acid and its conjugate base (or weak base and conjugate acid).",
      "example": "The phosphate buffer (H₂PO₄⁻/HPO₄²⁻) maintains pH in cells."
    },
    {
      "term": "Hemoglobin",
      "category": "Proteins",
      "definition": "A tetrameric (4-subunit) protein in red blood cells that binds and transports oxygen. Contains heme groups with iron (Fe²⁺) at the center.",
      "example": "Hemoglobin releases oxygen in tissues and is regenerated by O₂ binding in the lungs."
    },
    {
      "term": "Enzyme Inhibition",
      "category": "Catalysis",
      "definition": "A process that decreases enzyme activity. Can be competitive (inhibitor competes with substrate), non-competitive (inhibitor binds elsewhere), or irreversible.",
      "example": "Cyanide irreversibly inhibits cytochrome c oxidase, stopping the electron transport chain."
    },
    {
      "term": "Allosteric Regulation",
      "category": "Enzyme Regulation",
      "definition": "Regulation of enzyme activity through binding of regulatory molecules at a site different from the active site, causing conformational changes.",
      "example": "Phosphofructokinase in glycolysis is allosterically inhibited by ATP and citrate (feedback inhibition)."
    },
    {
      "term": "Feedback Inhibition",
      "category": "Enzyme Regulation",
      "definition": "A regulatory mechanism where the end product of a metabolic pathway inhibits an earlier step in the pathway, preventing overproduction.",
      "example": "Excess ATP inhibits phosphofructokinase, slowing glycolysis when energy is abundant."
    },
    {
      "term": "Prosthetic Group",
      "category": "Proteins",
      "definition": "A non-protein organic or inorganic molecular group that binds permanently to a protein and is essential for its function.",
      "example": "The heme group in hemoglobin and myoglobin."
    },
    {
      "term": "Hydrogen Bond",
      "category": "Chemical Bonds",
      "definition": "A weak interaction between a hydrogen atom bonded to an electronegative atom (N, O, F) and another electronegative atom. Critical for protein structure and base pairing.",
      "example": "Watson-Crick base pairs (A-T has 2 H-bonds; G-C has 3 H-bonds) stabilize DNA structure."
    },
    {
      "term": "Disulfide Bond",
      "category": "Chemical Bonds",
      "definition": "A covalent bond between two cysteine residues (-S-S-) that can stabilize protein tertiary and quaternary structure.",
      "example": "Insulin has 3 disulfide bonds linking its A and B chains."
    },
    {
      "term": "Peptide Bond",
      "category": "Chemical Bonds",
      "definition": "A covalent bond linking the carboxyl group of one amino acid to the amino group of the next, forming the backbone of proteins.",
      "example": "A tripeptide has 2 peptide bonds connecting 3 amino acids."
    },
    {
      "term": "Denaturation",
      "category": "Protein Chemistry",
      "definition": "The loss of protein structure due to disruption of non-covalent interactions, typically caused by heat, pH extremes, or organic solvents.",
      "example": "Boiling an egg denatures egg white proteins, making them opaque."
    },
    {
      "term": "Phosphorylation",
      "category": "Protein Modification",
      "definition": "Addition of a phosphate group (PO₃²⁻) to a protein, typically on serine, threonine, or tyrosine residues. Common modification for regulating enzyme activity.",
      "example": "Glycogen phosphorylase is activated by phosphorylation during the 'fight or flight' response."
    },
    {
      "term": "Photosynthesis",
      "category": "Metabolism",
      "definition": "The process by which plants and photosynthetic organisms convert light energy, CO₂, and H₂O into glucose and O₂. Occurs in chloroplasts.",
      "example": "The light reactions occur in the thylakoid; the Calvin cycle occurs in the stroma."
    },
    {
      "term": "Electron Transport Chain (ETC)",
      "category": "Metabolism",
      "definition": "A series of protein complexes (I-IV) in the inner mitochondrial membrane that transfer electrons from NADH and FADH₂ to O₂, pumping protons and generating the proton gradient.",
      "example": "Complex I oxidizes NADH; Complex IV reduces O₂ to water."
    },
    {
      "term": "Fermentation",
      "category": "Metabolism",
      "definition": "An anaerobic metabolic pathway that regenerates NAD+ from NADH without using oxygen, allowing glycolysis to continue in the absence of O₂.",
      "example": "Lactate fermentation in muscles during intense exercise; ethanol fermentation in yeast."
    },
    {
      "term": "Lactate",
      "category": "Metabolic Intermediates",
      "definition": "The 3-carbon anion formed when pyruvate is reduced during lactate fermentation. Accumulates in muscles during intense exercise.",
      "example": "Lactate is converted back to glucose in the liver via gluconeogenesis (the Cori cycle)."
    },
    {
      "term": "Gluconeogenesis",
      "category": "Metabolism",
      "definition": "The synthesis of new glucose from non-carbohydrate precursors (lactate, amino acids, glycerol) in the liver. Critical for maintaining blood glucose during fasting.",
      "example": "Lactate from muscles is gluconeogenized to glucose in the liver during fasting."
    },
    {
      "term": "Glycogenesis",
      "category": "Metabolism",
      "definition": "The synthesis of glycogen from glucose. Occurs primarily in liver and muscle when glucose is abundant.",
      "example": "After a carbohydrate-rich meal, excess glucose is converted to glycogen for storage."
    },
    {
      "term": "Glycogenolysis",
      "category": "Metabolism",
      "definition": "The breakdown of glycogen to glucose (in liver) or glucose-6-phosphate (in muscle) for energy production.",
      "example": "During fasting, liver glycogenolysis maintains blood glucose until glycogen is depleted."
    },
    {
      "term": "Lipogenesis",
      "category": "Metabolism",
      "definition": "The synthesis of fatty acids from acetyl-CoA and malonyl-CoA in the fed state. Occurs primarily in liver and adipose tissue.",
      "example": "Excess carbohydrate and protein are converted to fatty acids when energy intake exceeds expenditure."
    },
    {
      "term": "Lipolysis",
      "category": "Metabolism",
      "definition": "The breakdown of triglycerides into glycerol and fatty acids, typically occurring during fasting or exercise.",
      "example": "Epinephrine activates hormone-sensitive lipase in adipose tissue, triggering lipolysis."
    },
    {
      "term": "Mitochondrion",
      "category": "Cellular Structure",
      "definition": "The 'powerhouse of the cell'; an organelle where the citric acid cycle, oxidative phosphorylation, and fatty acid oxidation occur.",
      "example": "Muscle cells have thousands of mitochondria to supply energy for contraction."
    },
    {
      "term": "Chloroplast",
      "category": "Cellular Structure",
      "definition": "An organelle in plant cells where photosynthesis occurs. Contains thylakoids (light reactions) and stroma (Calvin cycle).",
      "example": "Chloroplasts are double-membraned organelles with their own DNA."
    },
    {
      "term": "Ribosome",
      "category": "Cellular Structure",
      "definition": "The cellular machine that synthesizes proteins, consisting of rRNA and ribosomal proteins. 70S in prokaryotes, 80S in eukaryotes.",
      "example": "Ribosomes decode mRNA and catalyze peptide bond formation during translation."
    },
    {
      "term": "Substrate-Level Phosphorylation",
      "category": "Energy Production",
      "definition": "Direct synthesis of ATP from ADP using energy from a substrate. Occurs in glycolysis and the citric acid cycle.",
      "example": "In glycolysis, 1,3-bisphosphoglycerate transfers its phosphate to ADP, forming ATP."
    },
    {
      "term": "Chemiosmosis",
      "category": "Energy Production",
      "definition": "The synthesis of ATP driven by the proton gradient across the inner mitochondrial membrane. Proposed by Peter Mitchell.",
      "example": "The electrochemical potential of ~180 mV drives ATP synthase to produce ATP."
    },
      {
    "term": "Glycolytic Enzymes",
    "category": "Metabolism / Enzyme Kinetics",
    "definition": "Key enzymes that catalyze steps in glycolysis, often regulated allosterically or via covalent modification.",
    "example": "Hexokinase, phosphofructokinase-1 (PFK-1), and pyruvate kinase are rate-limiting glycolytic enzymes."
  },
  {
    "term": "Pyruvate Dehydrogenase Complex (PDC)",
    "category": "Metabolism / Metabolic Intermediates",
    "definition": "A multi-enzyme complex that converts pyruvate to acetyl-CoA, linking glycolysis to the citric acid cycle. Requires TPP, lipoamide, FAD, CoA, and NAD+.",
    "example": "Pyruvate + CoA + NAD⁺ → Acetyl-CoA + CO₂ + NADH."
  },
  {
    "term": "Ketogenesis",
    "category": "Metabolism",
    "definition": "The formation of ketone bodies (acetoacetate, β-hydroxybutyrate, acetone) in the liver during prolonged fasting or low-carbohydrate intake.",
    "example": "Fatty acids are converted to acetyl-CoA, which is then used to produce ketone bodies for energy in the brain."
  },
  {
    "term": "Glucagon",
    "category": "Hormones / Metabolic Regulation",
    "definition": "A peptide hormone secreted by pancreatic α-cells that raises blood glucose by stimulating glycogenolysis and gluconeogenesis.",
    "example": "During fasting, glucagon promotes liver glycogen breakdown to maintain plasma glucose."
  },
  {
    "term": "Insulin",
    "category": "Hormones / Metabolic Regulation",
    "definition": "A peptide hormone secreted by pancreatic β-cells that lowers blood glucose by promoting glucose uptake, glycogenesis, and lipogenesis.",
    "example": "After a carbohydrate-rich meal, insulin stimulates GLUT4-mediated glucose uptake in muscle and adipose tissue."
  },
  {
    "term": "AMP-Activated Protein Kinase (AMPK)",
    "category": "Metabolic Regulation",
    "definition": "A cellular energy sensor activated by high AMP/ATP ratio; stimulates catabolic pathways and inhibits anabolic pathways to restore energy balance.",
    "example": "AMPK activates glucose uptake and fatty acid oxidation during low-energy states."
  },
  {
    "term": "G-Protein Coupled Receptors (GPCRs)",
    "category": "Cell Signaling",
    "definition": "Membrane receptors that activate heterotrimeric G-proteins upon ligand binding, initiating second-messenger signaling (cAMP, IP₃/DAG).",
    "example": "Epinephrine binds β-adrenergic receptors to activate adenylate cyclase via Gs proteins."
  },
  {
    "term": "Second Messengers",
    "category": "Cell Signaling",
    "definition": "Intracellular molecules that relay signals from receptors to target proteins, amplifying the signal. Common examples include cAMP, cGMP, IP₃, DAG, and Ca²⁺.",
    "example": "cAMP activates protein kinase A (PKA), which phosphorylates target proteins."
  },
  {
    "term": "Protein Kinase / Phosphatase",
    "category": "Protein Modification / Enzyme Regulation",
    "definition": "Protein kinases add phosphate groups to proteins; phosphatases remove them. These reversible modifications regulate protein activity and signaling pathways.",
    "example": "PKA phosphorylates glycogen phosphorylase kinase, activating glycogen breakdown."
  },
  {
    "term": "Oxidative Stress",
    "category": "Cellular Biology / Redox Biology",
    "definition": "Imbalance between reactive oxygen species (ROS) production and antioxidant defense, leading to cellular damage.",
    "example": "Superoxide dismutase converts superoxide radicals to hydrogen peroxide, reducing oxidative stress."
  },
  {
    "term": "Pentose Phosphate Pathway (PPP)",
    "category": "Metabolism",
    "definition": "A cytosolic pathway that generates NADPH for biosynthesis and ribose-5-phosphate for nucleotide synthesis.",
    "example": "Glucose-6-phosphate → NADPH + ribose-5-phosphate; important in rapidly dividing cells."
  },
  {
    "term": "Fructose-2,6-Bisphosphate",
    "category": "Metabolic Regulation",
    "definition": "A potent allosteric activator of phosphofructokinase-1 (glycolysis) and inhibitor of fructose-1,6-bisphosphatase (gluconeogenesis).",
    "example": "High F2,6BP levels favor glycolysis over gluconeogenesis in the fed state."
  },
  {
    "term": "Acid-Base Regulation",
    "category": "Physiology / Solution Chemistry",
    "definition": "The control of blood pH (~7.4) through buffer systems, respiratory CO₂ removal, and renal H⁺/HCO₃⁻ handling.",
    "example": "Carbonic anhydrase facilitates CO₂ + H₂O ⇌ H₂CO₃ ⇌ H⁺ + HCO₃⁻."
  },
  {
    "term": "Zymogen",
    "category": "Enzyme Regulation",
    "definition": "An inactive precursor of an enzyme that requires cleavage to become active. Prevents uncontrolled enzymatic activity.",
    "example": "Trypsinogen (from pancreas) is converted to trypsin in the small intestine."
  },
  {
    "term": "Ubiquitination",
    "category": "Protein Modification",
    "definition": "Covalent attachment of ubiquitin to lysine residues on proteins, targeting them for degradation via the proteasome.",
    "example": "Misfolded proteins in the ER are ubiquitinated and degraded by the 26S proteasome."
  },
  {
    "term": "Signal Peptide",
    "category": "Protein Targeting",
    "definition": "Short N-terminal amino acid sequence that directs a nascent protein to the ER for secretion or membrane insertion.",
    "example": "Secreted hormones like insulin are synthesized with an ER signal peptide."
  },
  {
    "term": "Lipid Rafts",
    "category": "Membrane Structure",
    "definition": "Cholesterol- and sphingolipid-rich microdomains in the plasma membrane that organize signaling molecules.",
    "example": "Receptors and G-proteins localize in lipid rafts to enhance signaling efficiency."
  },
  {
    "term": "Chaperone Proteins",
    "category": "Protein Folding",
    "definition": "Proteins that assist the correct folding of other proteins, prevent aggregation, and aid in refolding misfolded proteins.",
    "example": "Heat shock proteins (Hsp70, Hsp90) assist folding under stress conditions."
  },
  {
    "term": "Glycosylation",
    "category": "Protein Modification",
    "definition": "Addition of carbohydrate groups to proteins (N-linked or O-linked), critical for protein folding, stability, and cell recognition.",
    "example": "Erythropoietin is N-glycosylated, which increases its half-life in circulation."
  },
  {
    "term": "Lactate Dehydrogenase (LDH)",
    "category": "Metabolism / Enzyme",
    "definition": "Enzyme that interconverts pyruvate and lactate, regenerating NAD⁺ under anaerobic conditions.",
    "example": "Pyruvate + NADH ⇌ Lactate + NAD⁺ in muscle during intense exercise."
  },
   {
    "term": "Hill Coefficient",
    "category": "Enzyme Kinetics / Protein Binding",
    "definition": "A measure of cooperativity in ligand binding. A Hill coefficient (nH) > 1 indicates positive cooperativity; nH = 1 indicates non-cooperative binding; nH < 1 indicates negative cooperativity.",
    "example": "Hemoglobin has a Hill coefficient of ~2.8, reflecting cooperative O2 binding."
  },
  {
    "term": "Bohr Effect",
    "category": "Protein Physiology",
    "definition": "The phenomenon where decreased pH (increased CO2) reduces hemoglobin’s affinity for oxygen, promoting O2 release in metabolically active tissues.",
    "example": "During exercise, increased CO2 lowers pH and shifts the O2 dissociation curve to the right."
  },
  {
    "term": "Oxygen Dissociation Curve",
    "category": "Protein Physiology",
    "definition": "A sigmoidal curve describing hemoglobin saturation as a function of partial pressure of oxygen (pO2). Reflects cooperative binding.",
    "example": "A right shift indicates decreased oxygen affinity (high CO2, low pH, high temperature, high 2,3-BPG)."
  },
  {
    "term": "2,3-Bisphosphoglycerate (2,3-BPG)",
    "category": "Metabolic Regulation",
    "definition": "A glycolytic intermediate that binds deoxygenated hemoglobin, decreasing its affinity for oxygen and promoting oxygen release.",
    "example": "At high altitude, 2,3-BPG levels increase to enhance oxygen delivery to tissues."
  },
  {
    "term": "Competitive Inhibition",
    "category": "Enzyme Kinetics",
    "definition": "An inhibitor competes with the substrate for the active site. Increases apparent Km but does not change Vmax.",
    "example": "Statins competitively inhibit HMG-CoA reductase."
  },
  {
    "term": "Noncompetitive Inhibition",
    "category": "Enzyme Kinetics",
    "definition": "An inhibitor binds to a site other than the active site, reducing Vmax without changing Km.",
    "example": "Heavy metals can act as noncompetitive enzyme inhibitors."
  },
  {
    "term": "Uncompetitive Inhibition",
    "category": "Enzyme Kinetics",
    "definition": "An inhibitor binds only to the enzyme-substrate complex, decreasing both Km and Vmax.",
    "example": "Rare in physiology but tested conceptually on Lineweaver-Burk plots."
  },
  {
    "term": "Lineweaver-Burk Plot",
    "category": "Enzyme Kinetics",
    "definition": "Double reciprocal plot (1/v vs 1/[S]) used to determine Km and Vmax and visualize inhibition patterns.",
    "example": "Competitive inhibition increases the slope but keeps the same y-intercept."
  },
  {
    "term": "Isoelectric Point (pI)",
    "category": "Protein Chemistry",
    "definition": "The pH at which a molecule carries no net electric charge. Important for electrophoresis and protein purification.",
    "example": "At pH below its pI, a protein is positively charged."
  },
  {
    "term": "Electrophoresis",
    "category": "Biochemical Techniques",
    "definition": "A technique that separates molecules based on size and charge using an electric field.",
    "example": "SDS-PAGE separates proteins primarily by molecular weight."
  },
  {
    "term": "SDS-PAGE",
    "category": "Biochemical Techniques",
    "definition": "Sodium dodecyl sulfate polyacrylamide gel electrophoresis; denatures proteins and gives them uniform negative charge to separate by size.",
    "example": "Smaller proteins migrate further down the gel."
  },
  {
    "term": "Western Blot",
    "category": "Biochemical Techniques",
    "definition": "Technique that uses antibodies to detect specific proteins after gel electrophoresis.",
    "example": "Used to detect expression of a signaling protein."
  },
  {
    "term": "Southern Blot",
    "category": "Biochemical Techniques",
    "definition": "Method for detecting specific DNA sequences using labeled probes.",
    "example": "Used to identify gene insertions."
  },
  {
    "term": "Northern Blot",
    "category": "Biochemical Techniques",
    "definition": "Technique used to detect specific RNA molecules.",
    "example": "Used to measure mRNA expression levels."
  },
  {
    "term": "PCR (Polymerase Chain Reaction)",
    "category": "Molecular Biology",
    "definition": "A technique that amplifies specific DNA sequences using thermal cycling, primers, and DNA polymerase.",
    "example": "Denaturation → Annealing → Extension cycles exponentially amplify DNA."
  },
  {
    "term": "Restriction Enzymes",
    "category": "Molecular Biology",
    "definition": "Endonucleases that cut DNA at specific palindromic sequences.",
    "example": "EcoRI cuts at GAATTC."
  },
  {
    "term": "Operon",
    "category": "Gene Regulation",
    "definition": "A cluster of genes under control of a single promoter in prokaryotes.",
    "example": "The lac operon is inducible; the trp operon is repressible."
  },
  {
    "term": "Lac Operon",
    "category": "Gene Regulation",
    "definition": "An inducible operon in E. coli regulated by lactose and glucose levels.",
    "example": "Allolactose binds the repressor, allowing transcription."
  },
  {
    "term": "Trp Operon",
    "category": "Gene Regulation",
    "definition": "A repressible operon regulated by tryptophan levels.",
    "example": "High tryptophan activates the repressor to shut down transcription."
  },
  {
    "term": "Apoptosis",
    "category": "Cell Biology",
    "definition": "Programmed cell death involving caspases, DNA fragmentation, and membrane blebbing without inflammation.",
    "example": "Cytochrome c release from mitochondria activates caspase cascade."
  },
  {
    "term": "Necrosis",
    "category": "Cell Biology",
    "definition": "Uncontrolled cell death caused by injury, leading to inflammation.",
    "example": "Ischemic tissue damage results in necrosis."
  },
  {
    "term": "Tight Junction",
    "category": "Cellular Structure",
    "definition": "Cell junction that prevents paracellular movement of molecules between epithelial cells.",
    "example": "Intestinal epithelial cells form tight junction barriers."
  },
  {
    "term": "Gap Junction",
    "category": "Cellular Structure",
    "definition": "Channels between adjacent cells allowing passage of ions and small molecules.",
    "example": "Cardiac muscle cells use gap junctions for synchronized contraction."
  },
  {
    "term": "Michaelis-Menten Assumptions",
    "category": "Enzyme Kinetics",
    "definition": "Model assumptions include steady-state approximation, [S] >> [E], and negligible product formation during initial velocity measurement.",
    "example": "Initial velocity experiments satisfy steady-state conditions."
  },
  {
    "term": "Redox Reaction",
    "category": "Thermodynamics / Metabolism",
    "definition": "A chemical reaction involving transfer of electrons; oxidation is loss, reduction is gain.",
    "example": "NAD+ is reduced to NADH during glycolysis."
  },
    {
    "term": "Allosteric Enzyme",
    "category": "Enzyme Regulation",
    "definition": "An enzyme whose activity is modulated by binding of effectors at sites other than the active site, often exhibiting sigmoidal kinetics.",
    "example": "Aspartate transcarbamoylase is allosterically inhibited by CTP and activated by ATP."
  },
  {
    "term": "Isozyme (Isoenzyme)",
    "category": "Enzyme Kinetics",
    "definition": "Different molecular forms of an enzyme that catalyze the same reaction but may differ in kinetics, regulation, or tissue distribution.",
    "example": "Lactate dehydrogenase has LDH-1 in heart and LDH-5 in liver."
  },
  {
    "term": "Glycosaminoglycans (GAGs)",
    "category": "Carbohydrates / Structural Biology",
    "definition": "Long unbranched polysaccharides with repeating disaccharide units; often sulfated and negatively charged, forming part of extracellular matrix.",
    "example": "Heparin, chondroitin sulfate, and hyaluronic acid are GAGs."
  },
  {
    "term": "Proteoglycan",
    "category": "Proteins / Structural Biology",
    "definition": "A core protein covalently attached to one or more glycosaminoglycan chains; major components of the extracellular matrix.",
    "example": "Aggrecan in cartilage provides hydration and resistance to compression."
  },
  {
    "term": "Lipopolysaccharide (LPS)",
    "category": "Lipids / Cell Biology",
    "definition": "Large glycolipid component of the outer membrane of Gram-negative bacteria; potent activator of the immune system.",
    "example": "LPS triggers Toll-like receptor 4 (TLR4) signaling and cytokine release."
  },
  {
    "term": "cAMP-Dependent Protein Kinase (PKA)",
    "category": "Cell Signaling / Enzyme Regulation",
    "definition": "A serine/threonine kinase activated by cAMP that phosphorylates target proteins to mediate cellular responses.",
    "example": "PKA phosphorylates glycogen synthase kinase to regulate glycogen metabolism."
  },
  {
    "term": "Nitric Oxide (NO)",
    "category": "Cell Signaling / Redox Biology",
    "definition": "A gaseous signaling molecule synthesized by nitric oxide synthase; diffuses across membranes and activates guanylate cyclase.",
    "example": "NO mediates vasodilation in endothelial cells."
  },
  {
    "term": "cGMP (Cyclic Guanosine Monophosphate)",
    "category": "Cell Signaling / Second Messengers",
    "definition": "A second messenger produced by guanylate cyclase; activates protein kinase G (PKG) and regulates ion channels.",
    "example": "NO stimulates cGMP production to relax smooth muscle."
  },
  {
    "term": "Apoptosome",
    "category": "Cell Biology / Apoptosis",
    "definition": "A multiprotein complex formed by cytochrome c and Apaf-1 that activates caspase-9, initiating the intrinsic apoptosis pathway.",
    "example": "Mitochondrial outer membrane permeabilization leads to apoptosome assembly."
  },
  {
    "term": "Necroptosis",
    "category": "Cell Biology",
    "definition": "Programmed necrosis mediated by RIPK1/RIPK3 and MLKL, leading to regulated cell death with inflammatory signaling.",
    "example": "Viral infections can trigger necroptosis in host cells."
  },
  {
    "term": "Proteasome",
    "category": "Protein Degradation",
    "definition": "A large protease complex that degrades ubiquitinated proteins into peptides, regulating protein turnover.",
    "example": "Misfolded ER proteins are targeted to the 26S proteasome for degradation."
  },
  {
    "term": "Autophagy",
    "category": "Cellular Biology",
    "definition": "A catabolic process where cells degrade and recycle cytoplasmic contents and organelles via autophagosomes and lysosomes.",
    "example": "Starvation induces autophagy to provide amino acids and energy."
  },
  {
    "term": "mTOR (Mechanistic Target of Rapamycin)",
    "category": "Cell Signaling / Metabolic Regulation",
    "definition": "A kinase that integrates nutrient, energy, and growth factor signals to regulate protein synthesis, autophagy, and metabolism.",
    "example": "mTORC1 activation stimulates ribosomal protein synthesis and inhibits autophagy."
  },
  {
    "term": "Glycation",
    "category": "Protein Chemistry / Pathophysiology",
    "definition": "Non-enzymatic covalent attachment of sugars to proteins or lipids, often leading to advanced glycation end products (AGEs).",
    "example": "Hemoglobin A1c is a glycated form of hemoglobin used to monitor long-term blood glucose."
  },
  {
    "term": "Reactive Oxygen Species (ROS)",
    "category": "Cellular Biology / Redox Biology",
    "definition": "Chemically reactive molecules containing oxygen (e.g., superoxide, hydrogen peroxide) that can damage DNA, lipids, and proteins.",
    "example": "Mitochondrial electron transport leaks electrons, generating ROS."
  },
  {
    "term": "Calcium-Induced Calcium Release (CICR)",
    "category": "Cell Signaling",
    "definition": "A process where small Ca²⁺ influx triggers release of more Ca²⁺ from the endoplasmic or sarcoplasmic reticulum.",
    "example": "Cardiac myocytes use CICR for excitation-contraction coupling."
  },
  {
    "term": "G-Protein Alpha Subunits (Gs, Gi, Gq)",
    "category": "Cell Signaling",
    "definition": "Subunits of heterotrimeric G-proteins that determine signaling output: Gs stimulates adenylate cyclase, Gi inhibits it, Gq activates PLC.",
    "example": "β-adrenergic receptor activates Gs, increasing cAMP and PKA activity."
  },
  {
    "term": "Signal Transduction Cascade",
    "category": "Cell Signaling",
    "definition": "A series of biochemical events triggered by receptor activation, often involving phosphorylation, second messengers, and transcriptional regulation.",
    "example": "MAPK/ERK pathway regulates cell proliferation and differentiation."
  },
  {
    "term": "Histone Modification",
    "category": "Epigenetics / Protein Modification",
    "definition": "Post-translational modifications (acetylation, methylation, phosphorylation) of histones that regulate chromatin structure and gene expression.",
    "example": "H3K27 acetylation is associated with transcriptionally active chromatin."
  },
  {
    "term": "Chromatin Remodeling Complexes",
    "category": "Epigenetics / Gene Regulation",
    "definition": "Multiprotein machines that reposition nucleosomes to allow or block access to DNA for transcription, replication, and repair.",
    "example": "SWI/SNF complex slides nucleosomes to expose promoter regions."
  }
  ]
}
